# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\GIT\RoboMate\PSoC\Microcontroller\Microcontroller.cydsn\Microcontroller.cyprj
# Date: Wed, 13 Dec 2023 15:57:32 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 14.285714285714285 -waveform {0 7.14285714285714} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 14.285714285714285 -waveform {0 7.14285714285714} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ServoClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 71 141} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 911 1823} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for C:\GIT\RoboMate\PSoC\Microcontroller\Microcontroller.cydsn\TopDesign\TopDesign.cysch
# Project: C:\GIT\RoboMate\PSoC\Microcontroller\Microcontroller.cydsn\Microcontroller.cyprj
# Date: Wed, 13 Dec 2023 15:57:27 GMT
